In [18]:
!python functions.py
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

Concatinating the stock data set of top technology company in US 
Company like google,Apple,Microsoft,Amazon,Netflix in a sigle dataframe

In [30]:
from functions import concat_dataset

df = concat_dataset(['AAPL_data.csv', 
                     'GOOGL_data.csv', 
                     'MSFT_data.csv', 
                     'AMZN_data.csv',
                     'NFLX_data.csv'], path = 'dataset')

In [29]:
df.head()

         date     open     high      low    close     volume  Name
0  2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
1  2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2  2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
3  2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
4  2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL